IdeaRS.Connections
CreateSegmentCommandData.EccentricityEndX Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the local eccentricity X at the end of beam
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double EccentricityEndX { get; set; }
Property Value
Type: Double
See Also
Reference
CreateSegmentCommandData Class
IdeaRS.Connections.Data Namespace